LTG2012/xiaozhi-esp32-echoear/main/boards/esp-vocat/esp_vocat.cc
#include "wifi_board.h"
#include "codecs/box_audio_codec.h"
#include "display/lcd_display.h"
#include "display/emote_display.h"
#include "application.h"
#include "button.h"
#include "config.h"
#include "backlight.h"
#include "esp_video.h"

#include <esp_log.h>
#include <esp_err.h>
#include <esp_timer.h>
#include "esp_idf_version.h"
#include <cinttypes>

#include <driver/i2c_master.h>
#include <cstdlib>
#include <mbedtls/base64.h>
#include "i2c_device.h"
#include "i2c_bus.h"
#include <esp_lcd_panel_io.h>
#include <esp_lcd_panel_ops.h>
#include <esp_lcd_st77916.h>
#include "esp_lcd_touch_cst816s.h"
#include "touch.h"

extern "C" {
#include "touch_button_sensor.h"
}

#include "driver/temperature_sensor.h"
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>
#include <freertos/task.h>

#define TAG "ESP-VoCat"

namespace Bmi260Motion {
extern const uint8_t kConfigBase64Start[] asm("_binary_bmi260_init_data_b64_start");
extern const uint8_t kConfigBase64End[] asm("_binary_bmi260_init_data_b64_end");
extern const uint8_t kBmi220ConfigHeaderBase64Start[] asm("_binary_bmi220_config_header_b64_start");
extern const uint8_t kBmi220ConfigHeaderBase64End[] asm("_binary_bmi220_config_header_b64_end");

constexpr uint8_t kI2cAddress = 0x68;
constexpr uint8_t kChipIdRegister = 0x00;
constexpr uint8_t kBmi220ChipId = 0x26;
constexpr uint8_t kBmi260ChipId = 0x27;
constexpr uint8_t kPwrConfRegister = 0x7C;
constexpr uint8_t kPwrCtrlRegister = 0x7D;
constexpr uint8_t kCommandRegister = 0x7E;
constexpr uint8_t kSoftResetCommand = 0xB6;
constexpr uint8_t kAccelConfigRegister = 0x40;
constexpr uint8_t kAccelRangeRegister = 0x41;
constexpr uint8_t kAccelDataRegister = 0x0C;
constexpr uint8_t kStatusRegister = 0x03;
constexpr uint8_t kAccelDataReady = 0x80;
constexpr uint8_t kInitCtrlRegister = 0x59;
constexpr uint8_t kInitAddr0Register = 0x5B;
constexpr uint8_t kInitDataRegister = 0x5E;
constexpr uint8_t kInternalStatusRegister = 0x21;
constexpr uint8_t kAccelEnable = 0x04;
constexpr uint8_t kAccelConfig100Hz = 0xA8;
constexpr uint8_t kAccelRange2G = 0x00;

struct AccelRaw {
    int16_t x;
    int16_t y;
    int16_t z;
};

static i2c_bus_device_handle_t imu_device_ = nullptr;

bool ReadAccelRaw(AccelRaw& accel);

static esp_err_t WriteRegister(uint8_t reg, uint8_t value)
{
    esp_err_t ret = i2c_bus_write_byte(imu_device_, reg, value);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "BMI260 write reg 0x%02X failed: %s", reg, esp_err_to_name(ret));
    }
    return ret;
}

static int HexNibble(uint8_t value)
{
    if (value >= '0' && value <= '9') {
        return value - '0';
    }
    if (value >= 'a' && value <= 'f') {
        return value - 'a' + 10;
    }
    if (value >= 'A' && value <= 'F') {
        return value - 'A' + 10;
    }
    return -1;
}

static esp_err_t DecodeConfiguration(uint8_t chip_id, uint8_t* config, size_t config_capacity,
                                     size_t& config_len)
{
    if (chip_id == kBmi260ChipId) {
        const size_t encoded_len = kConfigBase64End - kConfigBase64Start - 1;
        int ret = mbedtls_base64_decode(config, config_capacity, &config_len, kConfigBase64Start, encoded_len);
        return ret == 0 ? ESP_OK : ESP_FAIL;
    }

    const size_t encoded_len = kBmi220ConfigHeaderBase64End - kBmi220ConfigHeaderBase64Start - 1;
    const size_t source_capacity = (encoded_len / 4) * 3 + 3;
    uint8_t* source = static_cast<uint8_t*>(malloc(source_capacity));
    if (source == nullptr) {
        return ESP_ERR_NO_MEM;
    }

    size_t source_len = 0;
    int decode_ret = mbedtls_base64_decode(source, source_capacity, &source_len,
                                           kBmi220ConfigHeaderBase64Start, encoded_len);
    if (decode_ret != 0) {
        free(source);
        return ESP_FAIL;
    }

    config_len = 0;
    for (size_t i = 0; i + 3 < source_len && config_len < config_capacity; ++i) {
        if (source[i] != '0' || source[i + 1] != 'x') {
            continue;
        }
        int high = HexNibble(source[i + 2]);
        int low = HexNibble(source[i + 3]);
        if (high >= 0 && low >= 0) {
            config[config_len++] = static_cast<uint8_t>((high << 4) | low);
            i += 3;
        }
    }
    free(source);
    return ESP_OK;
}

static esp_err_t LoadConfiguration(uint8_t chip_id)
{
    constexpr size_t kConfigSize = 8192;
    size_t config_len = 0;
    uint8_t* config = static_cast<uint8_t*>(malloc(kConfigSize));
    if (config == nullptr) {
        return ESP_ERR_NO_MEM;
    }
    esp_err_t decode_ret = DecodeConfiguration(chip_id, config, kConfigSize, config_len);
    if (decode_ret != ESP_OK || config_len != kConfigSize) {
        free(config);
        ESP_LOGW(TAG, "BMI260-family configuration decode failed: %s, size: %u", esp_err_to_name(decode_ret),
                 static_cast<unsigned>(config_len));
        return ESP_FAIL;
    }

    esp_err_t ret = WriteRegister(kPwrConfRegister, 0x02);
    if (ret == ESP_OK) {
        vTaskDelay(pdMS_TO_TICKS(1));
    }
    if (ret == ESP_OK) {
        ret = WriteRegister(kInitCtrlRegister, 0x00);
    }
    for (size_t offset = 0; ret == ESP_OK && offset < config_len; offset += 32) {
        const size_t chunk_len = (config_len - offset) < 32 ? (config_len - offset) : 32;
        const uint16_t init_address = static_cast<uint16_t>(offset / 2);
        const uint8_t address[2] = {
            static_cast<uint8_t>(init_address & 0x0F),
            static_cast<uint8_t>(init_address >> 4),
        };
        ret = i2c_bus_write_bytes(imu_device_, kInitAddr0Register, sizeof(address), address);
        if (ret == ESP_OK) {
            ret = i2c_bus_write_bytes(imu_device_, kInitDataRegister, chunk_len, config + offset);
        }
    }
    free(config);
    if (ret != ESP_OK || WriteRegister(kInitCtrlRegister, 0x01) != ESP_OK) {
        ESP_LOGW(TAG, "BMI260 configuration upload failed");
        return ESP_FAIL;
    }

    uint8_t last_status = 0xFF;
    for (int attempt = 0; attempt < 15; ++attempt) {
        vTaskDelay(pdMS_TO_TICKS(10));
        if (i2c_bus_read_byte(imu_device_, kInternalStatusRegister, &last_status) == ESP_OK &&
            (last_status & 0x0F) == 0x01) {
            ESP_LOGI(TAG, "BMI260 configuration loaded");
            return ESP_OK;
        }
    }
    ESP_LOGW(TAG, "BMI260 configuration did not reach ready state (status=0x%02X)", last_status);
    return ESP_FAIL;
}

esp_err_t Initialize(i2c_bus_handle_t i2c_bus)
{
    if (imu_device_ != nullptr) {
        return ESP_OK;
    }
    if (!i2c_bus) {
        return ESP_ERR_INVALID_ARG;
    }

    imu_device_ = i2c_bus_device_create(i2c_bus, kI2cAddress, 400000);
    if (imu_device_ == nullptr) {
        return ESP_FAIL;
    }

    uint8_t chip_id = 0;
    esp_err_t ret = i2c_bus_read_byte(imu_device_, kChipIdRegister, &chip_id);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "BMI260 chip ID read failed: %s", esp_err_to_name(ret));
        i2c_bus_device_delete(&imu_device_);
        return ret;
    }
    // PCB v1.0 returns 0x26 even though its BOM specifies BMI260.  Accept it
    // here, but keep the value visible in the boot log for traceability.
    if (chip_id != kBmi260ChipId && chip_id != kBmi220ChipId) {
        ESP_LOGW(TAG, "Unexpected IMU chip ID 0x%02X", chip_id);
        i2c_bus_device_delete(&imu_device_);
        return ESP_ERR_NOT_SUPPORTED;
    }

    ESP_LOGI(TAG, "BMI260 driver detected %s at 0x%02X (chip ID 0x%02X)",
             chip_id == kBmi220ChipId ? "BMI220-compatible IMU" : "BMI260", kI2cAddress, chip_id);
    if (WriteRegister(kCommandRegister, kSoftResetCommand) != ESP_OK) {
        i2c_bus_device_delete(&imu_device_);
        return ESP_FAIL;
    }
    vTaskDelay(pdMS_TO_TICKS(2));

