LTG2012/xiaozhi-esp32-echoear/main/boards/esp-vocat/esp_vocat.cc
            bool codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
            uint8_t pcb_version = 0;
            if (codec_alive) {
                ESP_LOGI(TAG, "PCB version V1.0");
                pcb_version = 0;
            } else {
                ESP_ERROR_CHECK(gpio_set_level(CORDEC_POWER_CTRL, 1));
                vTaskDelay(pdMS_TO_TICKS(50));
                codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
                if (codec_alive) {
                    ESP_LOGI(TAG, "PCB version V1.2");
                    pcb_version = 1;
                    AUDIO_I2S_GPIO_DIN = AUDIO_I2S_GPIO_DIN_2;
                    AUDIO_CODEC_PA_PIN = AUDIO_CODEC_PA_PIN_2;
                    QSPI_PIN_NUM_LCD_RST = QSPI_PIN_NUM_LCD_RST_2;
                    TOUCH_PAD2 = TOUCH_PAD2_2;
                    UART1_TX = UART1_TX_2;
                    UART1_RX = UART1_RX_2;
                } else {
                    ESP_LOGE(TAG, "PCB version detection error");
                }
            }
            return pcb_version;
        }

    bool ProbeI2cDevice(uint8_t address, const char* device_name)
    {
        constexpr int kProbeAttempts = 3;
        esp_err_t ret = ESP_FAIL;
        for (int i = 0; i < kProbeAttempts; ++i) {
            ret = i2c_master_probe(i2c_bus_, address, 100);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "%s detected at I2C address 0x%02X", device_name, address);
                return true;
            }
            vTaskDelay(pdMS_TO_TICKS(20));
        }
        ESP_LOGW(TAG, "%s not detected at I2C address 0x%02X: %s",
                 device_name, address, esp_err_to_name(ret));
        return false;
    }

    static void touch_isr_callback(void* arg)
    {
        Cst816s* touchpad = static_cast<Cst816s*>(arg);
        if (touchpad != nullptr) {
            touchpad->NotifyTouchEvent();
        }
    }

    static void touch_event_task(void* arg)
    {
        Cst816s* touchpad = static_cast<Cst816s*>(arg);
        if (touchpad == nullptr) {
            ESP_LOGE(TAG, "Invalid touchpad pointer in touch_event_task");
            vTaskDelete(NULL);
            return;
        }

        while (true) {
            if (touchpad->WaitForTouchEvent()) {
                auto &app = Application::GetInstance();
                auto &board = (EspVocat &)Board::GetInstance();

                ESP_LOGD(TAG, "Touch event, TP_PIN_NUM_INT: %d", gpio_get_level(TP_PIN_NUM_INT));
                if (!touchpad->UpdateTouchPoint()) {
                    continue;
                }
                auto touch_event = touchpad->CheckTouchEvent();

                if (touch_event == Cst816s::TOUCH_RELEASE) {
                    if (app.GetDeviceState() == kDeviceStateStarting) {
                        board.EnterWifiConfigMode();
                    } else {
                        app.ToggleChatState();
                    }
                }
            }
        }
    }

    void InitializeCharge()
    {
        if (!ProbeI2cDevice(0x55, "Charge IC")) {
            ESP_LOGW(TAG, "Battery measurement disabled");
            return;
        }
        charge_ = new Charge(i2c_bus_, 0x55);
        xTaskCreatePinnedToCore(battery_task, "batteryTask", 3 * 1024, this, 6, &charge_task_handle_, 0);
    }

    void InitializeCst816sTouchPad()
    {
        if (!ProbeI2cDevice(0x15, "Touch IC")) {
            ESP_LOGW(TAG, "Touch input disabled");
            return;
        }
        cst816s_ = new Cst816s(i2c_bus_, 0x15);

        xTaskCreatePinnedToCore(touch_event_task, "touch_task", 4 * 1024, cst816s_, 5, &touch_task_handle_, 1);

        const gpio_config_t int_gpio_config = {
            .pin_bit_mask = (1ULL << TP_PIN_NUM_INT),
            .mode = GPIO_MODE_INPUT,
            // .intr_type = GPIO_INTR_NEGEDGE
            .intr_type = GPIO_INTR_ANYEDGE
        };
        gpio_config(&int_gpio_config);
        gpio_install_isr_service(0);
        gpio_intr_enable(TP_PIN_NUM_INT);
        gpio_isr_handler_add(TP_PIN_NUM_INT, EspVocat::touch_isr_callback, cst816s_);
    }

    void InitializeBmi260()
    {
        esp_err_t imu_ret = Bmi260Motion::Initialize(shared_i2c_bus_handle_);
        if (imu_ret == ESP_OK) {
            imu_ready_ = true;
            xTaskCreatePinnedToCore(imu_event_task, "imu_task", 4 * 1024, this, 4, &imu_task_handle_, 1);
        } else {
            ESP_LOGW(TAG, "BMI260 unavailable, shake emotion disabled");
        }
    }

    static uint32_t TouchChannelFromPadGpio(gpio_num_t gpio)
    {
        if (gpio == GPIO_NUM_NC) {
            return 0;
        }
        if (gpio >= GPIO_NUM_1 && gpio <= GPIO_NUM_14) {
            return static_cast<uint32_t>(gpio);
        }
        return 0;
    }

    static void touch_button_event_callback(touch_button_handle_t handle, uint32_t channel, touch_state_t state, void* cb_arg)
    {
        (void)handle;
        auto* self = static_cast<EspVocat*>(cb_arg);
        if (self == nullptr || self->display_ == nullptr) {
            return;
        }
        if (!self->two_pad_touch_mode_) {
            if (state == TOUCH_STATE_ACTIVE) {
                ESP_LOGI(TAG, "Touch button ACTIVE ch=%" PRIu32, channel);
                self->ShowTouchFeedback("happy");
            }
            return;
        }

        const uint8_t channel_mask = channel == self->touch_pad1_channel_ ? BIT0 :
                                     channel == self->touch_pad2_channel_ ? BIT1 : 0;
        if (channel_mask == 0) {
            return;
        }
        const int64_t now_us = esp_timer_get_time();
        if (state == TOUCH_STATE_ACTIVE) {
            if (self->touch_release_pending_) {
                constexpr int64_t kTransitionWindowUs = 450 * 1000;
                if (now_us - self->touch_release_time_us_ <= kTransitionWindowUs &&
                    channel != self->touch_start_channel_) {
                    self->touch_swipe_detected_ = true;
                    self->touch_release_pending_ = false;
                    ESP_LOGI(TAG, "Touch pads switched ch%" PRIu32 " -> ch%" PRIu32,
                             self->touch_start_channel_, channel);
                } else {
                    self->ShowTouchFeedback(self->touch_swipe_detected_ ? "shocked" : "happy");
                    self->touch_swipe_detected_ = false;
                    self->touch_release_pending_ = false;
                    self->touch_start_channel_ = channel;
                    self->touch_start_time_us_ = now_us;
                }
            } else if (self->touch_active_mask_ == 0) {
                self->touch_start_channel_ = channel;
                self->touch_start_time_us_ = now_us;
                self->touch_swipe_detected_ = false;
                ESP_LOGI(TAG, "Touch pads start ch=%" PRIu32, channel);
            } else if (channel != self->touch_start_channel_ && now_us - self->touch_start_time_us_ >= 80 * 1000) {
                self->touch_swipe_detected_ = true;
                ESP_LOGI(TAG, "Touch pads overlapped ch%" PRIu32 " -> ch%" PRIu32,
                         self->touch_start_channel_, channel);
            }
            self->touch_active_mask_ |= channel_mask;
        } else {
            self->touch_active_mask_ &= ~channel_mask;
            if (self->touch_active_mask_ == 0) {
                self->touch_release_pending_ = true;
                self->touch_release_time_us_ = now_us;
            }
        }
    }

